server/app/controllers/todos_controller.rb

INSERT INTO "todos" ("title", "description", "status", "priority", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    todo = user.todos.create(todo_params)

SELECT "todos".* FROM "todos" WHERE "todos"."user_id" = ? AND "todos"."id" = ? LIMIT ?  [["user_id", 1], ["id", 6], ["LIMIT", 1]]
UPDATE "todos" SET "title" = ?, "description" = ?, "priority" = ?, "updated_at" = ? WHERE "todos"."id" = ?  [["title", "Rails Backend"], ["description", "Build the Rails backend now"], ["priority", 1], ["updated_at", "2023-03-24 08:02:05.815985"], ["id", 6]]
---
  def update
    todo = user.todos.find(params[:id])
    todo.update(todo_params)