server/app/controllers/users_controller.rb

INSERT INTO "users" ("username", "email", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["username", "oyier"], ["email", "mail@google.com"], ["password_digest", "[FILTERED]"], ["created_at", "2023-03-22 08:24:44.690876"], ["updated_at", "2023-03-22 08:24:44.690876"]]
---
  def register
    user = User.create!(user_params)

SELECT "users".* FROM "users" WHERE (username = 'oyier' OR email = 'mail@google.com') ORDER BY "users"."id" ASC LIMIT ?  [["LIMIT", 1]]
---
  def login
    sql = 'username = :username OR email = :email'

    user =
      User.where(
        sql,
        { username: user_params[:username], email: user_params[:email] },
      ).first